In [1]:
# https://stepik.org/lesson/216065/step/10?unit=188927
# А теперь используем эти методы на знаменитом титаническом датасэте! Загрузите датасэт, посмотрите на датафрэйм и ответьте на 
# вопросы
# Комментарий: в ответе необходимо указать количество колонок.

import pandas as pd

In [2]:
df = pd.read_csv('https://stepik.org/media/attachments/course/4852/titanic.csv')

In [3]:
df.shape

(891, 12)

In [4]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
df.loc[df['Age']>35]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q

In [18]:
# https://stepik.org/lesson/209767/step/6?unit=183265
# У какой доли студентов из датасэта в колонке lunch указано free/reduced?
# Формат ответа десятичная дробь, например, 0.25

df = pd.read_csv('https://stepik.org/media/attachments/course/4852/StudentsPerformance.csv')
df.loc[df['lunch'] == 'free/reduced'].shape[0] / df.shape[0]

0.355

In [29]:
# https://stepik.org/lesson/209767/step/7?unit=183265
# Как различается среднее и дисперсия оценок по предметам у групп студентов со стандартным или урезанным ланчем?

df.loc[df['lunch'] == 'standard'].mean() - df.loc[df['lunch'] == 'free/reduced'].mean()

math score       11.112982
reading score     7.000742
writing score     7.800721
dtype: float64

In [30]:
df.loc[df['lunch'] == 'standard'].var() - df.loc[df['lunch'] == 'free/reduced'].var()

math score      -43.406180
reading score   -30.585578
writing score   -32.581994
dtype: float64

In [33]:
# вывод - кто лучше питается, тот лучше учится и разброс оценок у них меньше :)
# альтернативный вариант решения

df.groupby('lunch').agg(['mean','var'])

             math score             reading score             writing score  \
                   mean         var          mean         var          mean
lunch
free/reduced  58.921127  229.824270     64.653521  221.871139     63.022535
standard      70.034109  186.418089     71.654264  191.285560     70.823256


                     var
lunch
free/reduced  238.202881
standard      205.620887